---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionLookupTable
source: html/0c9f96dd-fe5b-22b9-ee5c-47e607c57010.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticConstructionLookupTable Property

"Analytic Construction"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticConstructionLookupTable { get; }
```